CSI API ETABS v1
cAnalysisResults.LinkDeformation Method
 Reports the link internal deformations
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int LinkDeformation(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] Obj,
	ref string[] Elm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] U1,
	ref double[] U2,
	ref double[] U3,
	ref double[] R1,
	ref double[] R2,
	ref double[] R3
)
Function LinkDeformation (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef Obj As String(),
	ByRef Elm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef U1 As Double(),
	ByRef U2 As Double(),
	ByRef U3 As Double(),
	ByRef R1 As Double(),
	ByRef R2 As Double(),
	ByRef R3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim Obj As String()
Dim Elm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim U1 As Double()
Dim U2 As Double()
Dim U3 As Double()
Dim R1 As Double()
Dim R2 As Double()
Dim R3 As Double()
Dim returnValue As Integer
returnValue = instance.LinkDeformation(Name,
	ItemTypeElm, NumberResults, Obj,
	Elm, LoadCase, StepType, StepNum,
	U1, U2, U3, R1, R2, R3)
int LinkDeformation(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% Obj,
	array<String^>^% Elm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% U1,
	array<double>^% U2,
	array<double>^% U3,
	array<double>^% R1,
	array<double>^% R2,
	array<double>^% R3
)
abstract LinkDeformation :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        Obj : string[] byref *
        Elm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        U1 : float[] byref *
        U2 : float[] byref *
        U3 : float[] byref *
        R1 : float[] byref *
        R2 : float[] byref *
        R3 : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing link object, link element, or group of objects depending on the value of the ItemTypeElm item.
ItemTypeElm
Type: ETABSv1.eItemTypeElm
 This is one of the following items in the eItemTypeElm enumeration.
 If this item is ObjectElm, the result request is for the link element corresponding to the point object specified by the Name item.
 If this item is Element, the result request is for the link element specified by the Name item.
 If this item is GroupElm, the result request is for all link elements directly or indirectly specified in the group specified by the Name item.
 If this item is SelectionElm, the result request is for all link elements directly or indirectly selected and the Name item is ignored.
NumberResults
Type: System.Int32
 The total number of results returned by the program.
Obj
Type: System.String[]
 This is an array that includes the link object name associated with each result, if any.
Elm
Type: System.String[]
 This is an array that includes the link element name associated with each result.
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result.
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result.
U1
Type: System.Double[]
 This is an array that includes the internal translational deformation of the link in the link element local 1-axis direction [L]
U2
Type: System.Double[]
 This is an array that includes the internal translational deformation of the link in the link element local 2-axis direction [L]
U3
Type: System.Double[]
 This is an array that includes the internal translational deformation of the link in the link element local 3-axis direction [L]
R1
Type: System.Double[]
 This is an array that includes the internal rotational deformation of the link about the link element local 1-axis direction [L]
R2
Type: System.Double[]
 This is an array that includes the internal rotational deformation of the link about the link element local 2-axis direction [L]
R3
Type: System.Double[]
 This is an array that includes the internal rotational deformation of the link about the link element local 3-axis direction [L]
Return Value
Type: Int32
 Returns zero if the deformations are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim LinkObjName As String
       Dim NumberResults As Integer
       Dim Obj() As String
       Dim Elm() As String
       Dim LoadCase() As String
       Dim StepType() As String
       Dim StepNum() As Double
       Dim U1() As Double
       Dim U2() As Double
       Dim U3() As Double
       Dim R1() As Double
       Dim R2() As Double
       Dim R3() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link object by points
       ret = SapModel.LinkObj.AddByPoint("1", "2", LinkObjName)
   'set link property
       ret = SapModel.LinkObj.SetProperty(LinkObjName, "Link1")
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'get link deformations for link object
       ret = SapModel.Results.LinkDeformation(LinkObjName, eItemTypeElm.ObjectElm, NumberResults, Obj, Elm, LoadCase, StepType, StepNum, U1, U2, U3, R1, R2, R3)
   'check
       If NumberResults > 0 Then ret = 0 Else ret = -1
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace